na423-hw8-flatPlate/yPlus1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc graphs

    forceCoeffs
    {
        libs            ("libforces.so");
        type            forceCoeffs;
        writeControl    writeTime;
        rho             rhoInf;
        rhoInf          1;
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        CofR            (0.0 0 0); //
        pitchAxis       (0 0 1);
        magUInf         1.0;
        lRef            2.0; // length of bump
        Aref            0.4; // mesh length 2, width 0.2 
        patches         (plate);
    }

    wallShearStress
    {
        type            wallShearStress;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        patches         (plate);
    }

    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        patches         (plate);
    }

    cellCentres
    {
        type            writeCellCentres;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }

    residuals
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        fields          (".*");
    }

    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }

}

// ************************************************************************* //

// ************************************************************************* //
